<!DOCTYPE html>
<html lang="no">
<head>
<title>Flash og tilgjengelighet</title>
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
<meta content="text/css" http-equiv="Content-Style-Type">
<meta content="width=device-width, initial-scale=1" name="viewport">
<meta content="3e9026b2ccf2087cc69a03413ad23a8a" name="md5">
<link href="../../../favicon.ico" rel="icon" type="image/x-icon">
<link href="../../../css/markdown-template.css" rel="stylesheet">
<link href="index.txt" rel="alternate" title="Markdown" type="text/markdown">
<script type="text/x-mathjax-config">
MathJax.Hub.Config({
TeX: { equationNumbers: { autoNumber: "all" } }
})
</script>
<script async="" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-MML-AM_CHTML" type="text/javascript">
</script>
<script src="../../../js/markdown-template.js">
</script>
</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top">
<div class="container-fluid">
<ul class="nav nav-pills navbar-left">
<li role="presentation"><a href="/" title="Return home"><i class="fa fa-home"></i></a>
</li>
</ul>

<ul class="nav nav-pills navbar-right">
<li role="presentation"><a href="http://www.facebook.com/share.php?u=https%3A%2F%2Fepsil.github.io%2F2004%2F03%2F21%2F" title="Share on Facebook"><i class="fa fa-facebook-square"></i></a>
</li>

<li role="presentation"><a href="https://twitter.com/intent/tweet?url=https%3A%2F%2Fepsil.github.io%2F2004%2F03%2F21%2F" title="Share on Twitter"><i class="fa fa-twitter-square"></i></a>
</li>

<li role="presentation"><a href="https://github.com/epsil/epsil.github.io/edit/master/2004/03/21/index.txt" title="Edit on GitHub"><i class="fa fa-edit"></i></a>
</li>

<li role="presentation"><a href="https://github.com/epsil/epsil.github.io/commits/master/2004/03/21/index.txt" title="View history"><i class="fa fa-history"></i></a>
</li>

<li role="presentation"><a href="index.txt" title="Get Markdown source"><i class="fa fa-download"></i></a>
</li>

<li role="presentation"><a data-toggle="collapse" href="#toc" title="Table of contents"><i class="fa fa-list"></i></a>
</li>
</ul>
</div>
</nav>

<div class="container">
<article>
<header>
<section id="flash-og-tilgjengelighet">
<h1 class="title"><a aria-hidden="true" class="header-anchor" href="#flash-og-tilgjengelighet" title="Flash og tilgjengelighet"></a>Flash og tilgjengelighet</h1>

<div id="flash-og-tilgjengelighet-section">
<p><time><i class="fa fa-calendar-o"></i> 2004-03-21</time>
</p>
</div>
</section>
</header>

<section id="content">
<p>En nettside b&#248;r oppfylle tre&#160;krav:</p>

<ul>
<li>Kravet til innhold</li>

<li>Kravet til brukervennlighet</li>

<li>Kravet til tilgjengelighet</li>
</ul>

<p>Merk at &#171;brukervennlighet&#187; her ogs&#229; omfatter det estetiske aspektet ved siden; en pen og funksjonell side fungerer rett og slett mye bedre (og er mer tiltalende eller <em>vennlig</em>) enn en stygg og funksjonell side. (For mer om denne siden av saken, vil jeg anbefale Donald Normans klassiker <a href="http://vgrd.dk/arkiv/000158.php"><em>The Design of Everyday Things</em></a>.) V&#230;r ogs&#229; oppmerksom p&#229; at innhold og formidling er to fullstendig atskilte begreper. En god artikkel kan befinne seg p&#229; et nettsted med en forferdelig utforming, og en pen nettside kan v&#230;re totalt blottet for informasjon som kommer den bes&#248;kende til gode (og som f&#229;r vedkommende til &#229; &#171;bokmerke&#187;&#160;siden).</p>

<p>Tilgjengelighet angir hvor mange som er i stand til &#229; bes&#248;ke nettstedet &#8211; om det kan ses med h&#248;yest mulig antall nettlesere, i h&#248;yest mulig antall forskjellige oppl&#248;sninger og p&#229; forskjellige plattformer, og s&#229; videre. Dette er noe som tas h&#229;nd om i b&#229;de <abbr class="acronym" title="HyperText Markup Language"><span class="caps">HTML</span></abbr>- og <abbr class="acronym" title="Cascading Style Sheets"><span class="caps">CSS</span></abbr>-standardene, ved at informasjonen kan gjenbrukes ved &#229; bruke strukturbasert kode, at tilleggsinformasjon kan legges ved for dem som ikke er i stand til &#229; oppfatte hele siden p&#229; en gang, og ved at presentasjonsregler for flere medier kan angis (blant annet for talenettlesere). Merk at <abbr class="acronym" title="HyperText Markup Language"><span class="caps">HTML</span></abbr> og <abbr class="acronym" title="Cascading Style Sheets"><span class="caps">CSS</span></abbr> er fullstendig <em>&#229;pne</em> (og til dels &#171;standardiserte&#187;) formater. Hvem som helst kan benytte seg av disse formatene uten &#229; investere i ekstra programvare, og hvem som helst kan skrive programvare for produksjon, bearbeiding eller utveksling av data lagret i dem. Dette er selve n&#248;kkelen til fri og uhemmet utveksling av&#160;informasjon.</p>

<p>S&#229; hvordan kommer Flash inn i denne sammenhengen? Her velger jeg &#229; definere Flash som et <em>interaktivt format for animering av vektor- eller matrisebaserte figurer.</em> Det er ikke noe i denne definisjonen som tyder p&#229; at Flash er s&#230;rlig egnet til &#229; formidle tekstlig informasjon via en allmenn informasjonstjeneste som <abbr class="acronym" title="World Wide Web"><span class="caps">WWW</span></abbr>. For &#229; illustrere dette vil jeg n&#229; nevne noen ulemper slik bruk av formatet medf&#248;rer i praksis. Enkelte av de f&#248;lgende punktene overlapper hverandre, og det meste av dette er ikke relevant dersom man bare &#248;nsker &#229; <em>tjene penger;</em> her tar jeg bare stilling til hvordan Flash-baserte nettsider (ikke) oppfyller kravet til <em>tilgjengelighet</em> (beskrevet&#160;over).</p>

<p>Let&#8217;s begin:</p>

<ul>
<li><strong>Flash er et lukket format.</strong> Dette er hovedproblemet med Flash, og de videre ulempene jeg nevner i dette innlegget henger i stor grad sammen med dette. Skal du <em>lage</em> noe i Flash, trenger du kommersiell programvare fra Macromedia. Skal du <em>se</em> Flash, trenger du ogs&#229; programvare fra Macromedia. Det er bare Macromedia som vet hvordan Flash faktisk fungerer, og du har dermed ingen garanti for at Flash-filene dine vil fungere ogs&#229; p&#229; fremtidens&#160;plattformer.</li>

<li><strong>Flash-sider fungerer ikke dersom du ikke har Flash.</strong> Dette h&#248;res kanskje ut som et absurd argument, men det er faktisk dette som er kjernen i skillet mellom innhold og presentasjon. Du trenger ikke en nettleser med <abbr class="acronym" title="Cascading Style Sheets"><span class="caps">CSS</span></abbr>-st&#248;tte for &#229; lese en (strukturbasert) nettside som gj&#248;r bruk av <abbr class="acronym" title="Cascading Style Sheets"><span class="caps">CSS</span></abbr>; informasjonen er fortsatt tilgjengelig, strukturert og&#160;fin.</li>

<li><strong>Flash er et mediespesifikt format.</strong> Per dags dato <em>krever</em> Flash-nettsider at du har en grafisk nettleser; som oftest er det ogs&#229; helt n&#248;dvendig at du har et forh&#229;ndsbestemt skjermareal til disposisjon (de fleste Flash-sider er ikke skalerbare). Flash-sider vil alts&#229; ikke fungere i <em><abbr title="for eksempel">f.eks.</abbr></em> tekstnettlesere, talenettlesere eller nettlesere med begrenset visningsareal (<abbr title="for eksempel">f.eks.</abbr> p&#229; mobiltelefoner). Problemet er igjen det ikke-eksisterende skillet mellom innhold og presentasjon. (Dette <em>kan</em> endre seg med &#171;<a href="http://www.section508.gov/">Section 508</a>&#187;, men det gjenst&#229;r &#229; se om ikke Macromedia er for sent&#160;ute.)</li>

<li><strong>Flash fungerer ikke p&#229; alle plattformer.</strong> Som nevnt er det bare Macromedia som utvikler programvare for Flash, og derfor er det ogs&#229; Macromedia som bestemmer hvem som kan se Flash (og benytte seg av Flash-baserte nettsider). Flash-nettsider er ubrukelige i nettlesere det ikke eksisterer Flash-st&#248;tte for; i og med at antallet popul&#230;re nettlesere og plattformer &#248;ker, er dette et stadig voksende problem. (I tillegg har jeg hatt problemer med at Flash-sider <em>krasjer</em> p&#229; eldre&#160;datamaskiner.)</li>

<li><strong>S&#248;kemotorer leser ikke Flash.</strong> Dette henger sammen med forrige punkt, og er kanskje den st&#248;rste grunnen til at Flash b&#248;r unng&#229;s som et tekstformat. Det er i dag umulig &#229; indeksere og finne tilbake til informasjon i Flash-sider, noe som gj&#248;r innholdet usynlig i &#171;den store&#160;sammenhengen&#187;.</li>

<li><strong>Ikke alle liker Flash.</strong> Her tenker jeg ikke p&#229; utformingen til Flash-sider, men de nye mengder ekstra forstyrrende nettreklame Flash-formatet har p&#229;f&#248;rt oss. Som f&#248;lge av dette velger mange &#229; <a href="http://www.virtuelvis.com/archives/117.html">sl&#229; av Flash</a>. (Dette hadde ikke v&#230;rt noe problem dersom innhold og presentasjon var separert ogs&#229; i&#160;Flash.)</li>

<li><strong>Flash er et bin&#230;rt format.</strong> I motsetning til et <abbr class="acronym" title="HyperText Markup Language"><span class="caps">HTML</span></abbr>-dokument g&#229;r ofte hele Flash-fila tapt dersom en byte eller to kommer p&#229; avveie. <abbr class="acronym" title="HyperText Markup Language"><span class="caps">HTML</span></abbr>, som er et tekstformat, kan leses av mennesker og er som regel lett &#229; rette opp i; bin&#230;rformater krever egne verkt&#248;y, og det er bare Macromedia som kan utvikle dette. Dette gj&#248;r Flash uegnet som et <em>varig lagringsformat</em> (gjelder for &#248;vrig de fleste lukkede&#160;formater).</li>

<li><strong>Det er vanskelig &#229; ta i bruk Flash uten &#229; bryte andre nettstandarder.</strong> Det som kjennetegner en god standard er at den er kompatibel med andre standarder eller formater. Det er i <abbr class="acronym" title="HyperText Markup Language"><span class="caps">HTML</span></abbr>-spesifikasjonen beskrevet en generell mekanisme for integrering av multimediaobjekter p&#229; nettsider, men denne st&#248;ttes ikke av alle nettlesere. (<a href="http://www.alistapart.com/">A List Apart</a> har beskrevet en <a href="http://www.alistapart.com/articles/flashsatay/">tungvint omvei</a> som virker i alle nettlesere; imidlertid neppe noe som er tatt i bruk p&#229; de aller fleste sider som baserer seg p&#229;&#160;Flash.)</li>
</ul>

<p>Blir da konklusjonen at Flash er en fullstendig verdil&#248;s oppfinnelse? Ikke i utgangspunktet. Flash er tross alt et fremragende format for vektorbaserte figurer og animering, og tar liten plass. Det kunne med andre ord ha fungert perfekt til <em>illustrasjoner</em> p&#229; <abbr title="for eksempel">f.eks.</abbr> (<abbr class="acronym" title="HyperText Markup Language"><span class="caps">HTML</span></abbr>-baserte) nettsider. Macromedias pengehunger har imidlertid villet det annerledes, og pr&#248;vd &#229; forvandle formatet til noe det ikke har forutsetninger for &#229;&#160;v&#230;re.</p>
<!--
Det fungerer fortsatt godt til kommersielle form嬬 men har begrenset verdi p堥n i utgangspunktet ikke-kommersiell informasjonstjeneste som WWW.

Jeg vil forresten p尥ke at ingen her er i stand til 堪kreve* hvordan en nettside skal v沥. Internett er fullstendig anarki, og man er stort sett fri til 堧j𲥠hva man vil. Det er imidlertid allmenn enighet om at enkelte kj𲥲egler er det eneste som kan fungere i lengden (og for alle).
-->
</section>
</article>
</div>
</body>
</html>
